{"jobs": {"1": {"id": "94392c8b-af3e-4454-9bdb-3cd2c7110bd0", "name": "Ciência de Dados | Engenheiro de IA Júnior", "main_activities": "\nDesenvolver e manter pipelines de dados para alimentar modelos de IA (coleta, limpeza, enriquecimento e validação).\nApoiar na implantação de modelos de IA em produção, com foco em escalabilidade, performance e custo.\nMonitorar e otimizar modelos em produção, ajustando métricas de performance e robustez.\nColaborar com analistas e cientistas de dados na análise exploratória e geração de insights.\nDocumentar e versionar os processos e modelos implantados.\nParticipar da avaliação de novas ferramentas e soluções de IA. \n", "prerequisities": "\nFormação em Ciência da Computação, Engenharia, Estatística ou áreas correlatas.\nExperiência com Python e bibliotecas como Pandas, Scikit-Learn, PyTorch ou TensorFlow.\nConhecimento em bancos de dados (SQL, NoSQL) e ferramentas de visualização (Power BI, Excel).\nVivência com ambientes em nuvem (AWS, Azure) e ferramentas de orquestração (Docker, Kubernetes).\nFamiliaridade com práticas de DevOps, DataOps ou MLOps.\nDesejável experiência com modelos generativos ou LLMs.\nBoa capacidade de comunicação e trabalho colaborativo.\n", "differentials": ""}}, "resums": {"1": {"resum_id": "9f436902-8902-4a11-9777-1c2132950957", "job_id": "94392c8b-af3e-4454-9bdb-3cd2c7110bd0", "content": "\n## Nome Completo\nLucas Canedo\n\n## Experiência\n- **Analista de Dados (Pleno) – BB ASSET (GlobalWeb)**  \n  Mai/2025 – Atual  \n  - Criação e manutenção de dashboards em Power BI (modelagem, publicação, atualização no Power BI Service).  \n  - Extração e tratamento de dados com SQL, Power Query e Excel.  \n  - Suporte técnico e condução de sessões hands‑on.  \n  - Automação de rotinas com Power Apps e Power Automate.\n\n- **Analista de Infraestrutura – Big Data / Data Science (Pleno) – CASSI (Stefanini)**  \n  Ago/2023 – Mai/2025  \n  - Levantamento de requisitos e desenvolvimento de soluções analíticas usando SQL, Python (Databricks) e Excel.  \n  - Desenvolvimento de dashboards Power BI, incluindo modelagem e agendamento de atualizações.  \n  - Atendimento a incidentes e solicitações técnicas em ambiente Kanban.\n\n- **Administrador de Banco de Dados (Júnior) – CASSI**  \n  Nov/2022 – Ago/2023  \n  - Suporte à criação e manutenção de bases de dados para análises.  \n  - Processos ETL com SQL, Power Query e Excel.  \n  - Desenvolvimento e automação de relatórios e painéis no Power BI.\n\n- **Hospital Sírio‑Libanês (Brasília)**  \n  - Auxiliar Administrativo: Mai/2022 – Nov/2022 – Atualização de planilhas de agendamento de pacientes e solicitação de autorizações.  \n  - Jovem Aprendiz: Fev/2021 – Mai/2022 – Rotinas administrativas, arquivamento, digitalização de documentos e apoio financeiro.\n\n## Habilidades \n- Machine Learning  \n- Databricks  \n- Python (Data Science)  \n- SQL  \n- Power BI (modelagem, DAX, publicação, Power BI Service)  \n- Power Query & Excel (ETL)  \n- Power Apps & Power Automate (automação)  \n- Desenvolvimento de dashboards e data storytelling  \n- Suporte técnico e treinamento de usuários  \n\n## Educação \n- **Bacharel em Ciência de Dados e Inteligência Artificial** – UNIDOMBOSCO (2020 – 2024)  \n- **Ensino Médio** – Colégio Adventista Asa Sul (2019)  \n\n## Idiomas \n- Português – Nativo  \n- Inglês – Intermediário  \n```", "opnion": "**RELATÓRIO ANALÍTICO – CURRÍCULO X VAGA**  \n*Ciência de Dados | Engenheiro de IA Júnior*  \n\n---\n\n## 1️⃣ PONTOS DE ALINHAMENTO  \n\n| Requisito da Vaga | Evidência no Currículo | Comentário |\n|-------------------|------------------------|------------|\n| **Formação em áreas correlatas (Ciência de Dados, IA, Estatística, Engenharia)** | Bacharelado em **Ciência de Dados e Inteligência Artificial** (UNIDOMBOSCO, 2020‑2024) | Formação exatamente alinhada ao escopo da vaga. |\n| **Experiência com Python e bibliotecas de ciência de dados** | Uso de **Python** para extração e tratamento de dados (Databricks) nas experiências na CASSI (Ago/23‑Mai/25). Cursos de **Python para Data Science** (Jun/23) e **Machine Learning** (Jun/23). | Demonstrado domínio prático; porém não há menção explícita a bibliotecas como *Pandas, Scikit‑Learn, PyTorch ou TensorFlow*. |\n| **Conhecimento em bancos de dados (SQL)** | Atuação com **SQL** em todas as posições (GlobalWeb, CASSI, etc.). | Atende ao requisito. |\n| **Ferramentas de visualização (Power BI, Excel)** | Criação, modelagem e publicação de dashboards em **Power BI** (todos os cargos). Uso avançado de **Excel** e **Power Query**. | Excelente correspondência. |\n| **Experiência em pipelines de dados / ETL** | Execução de processos **ETL** com SQL, Power Query, Excel; automação via **Power Apps/Power Automate**. | Alinhado, embora o foco seja mais em relatórios que em pipelines de IA. |\n| **Trabalho colaborativo e comunicação** | Condução de sessões “hands‑on” para usuários, suporte técnico inter‑departamental, projetos voluntários. | Indica boa habilidade de comunicação e trabalho em equipe. |\n| **Conhecimento em nuvem (Azure)** | Não explicitado, porém o uso de **Power BI Service**, **Power Apps**, **Power Automate** e **Databricks** (geralmente Azure) sugere exposição ao ecossistema Azure. | Possível alinhamento implícito, mas falta confirmação clara. |\n| **Práticas de DevOps / DataOps / MLOps** | Não há menção a **Docker, Kubernetes, CI/CD, pipelines de deployment**. | Ausência de evidência. |\n| **Modelos generativos ou LLMs** | Nenhum registro. | Falta de experiência desejada. |\n\n**Resumo do Alinhamento**  \nO candidato possui a formação acadêmica ideal e demonstra sólido domínio de Python, SQL, Power BI e processos de ETL. Há experiência prática em ambientes de analytics corporativo (CASSI, GlobalWeb) e habilidades de comunicação que atendem às expectativas de colaboração. Contudo, a profundidade em bibliotecas específicas de Machine Learning e em infraestrutura de IA (Docker, Kubernetes, MLOps) é insuficiente ou não declarada.\n\n---\n\n## 2️⃣ PONTOS DE DESALINHAMENTO  \n\n| Requisito Não Atendido | Evidência da Falta | Impacto na Vaga |\n|------------------------|--------------------|-----------------|\n| **Domínio de bibliotecas de ML (Scikit‑Learn, PyTorch, TensorFlow)** | O currículo lista apenas “Machine Learning” como conhecimento, sem citar bibliotecas. | Impede o candidato de desenvolver/treinar modelos de IA de forma independente. |\n| **Experiência com ambientes de nuvem (AWS, Azure) e serviços de IA** | Não há menção explícita a **AWS** ou **Azure**, nem a serviços como **SageMaker**, **Azure ML**, **MLflow**. | Dificulta a implantação e escalabilidade dos modelos, que é foco da vaga. |\n| **Orquestração e containerização (Docker, Kubernetes)** | Ausência total de referência a essas tecnologias. | A vaga requer capacidade de criar pipelines escaláveis e gerenciáveis; o candidato não demonstra preparo. |\n| **Práticas de DevOps/DataOps/MLOps** | Nenhum projeto ou certificação que evidencie pipelines automatizados, versionamento de modelos ou monitoramento em produção. | Falta de experiência crítica para “monitorar e otimizar modelos em produção”. |\n| **Experiência com modelos generativos ou LLMs** | Não há menção a projetos ou cursos nessa área. | Diferencial desejado não atendido. |\n| **Nível de Inglês** | Declarado como **intermediário**. | Pode limitar a leitura de documentação técnica avançada (bibliotecas, papers) e comunicação com equipes globais. |\n| **Tempo de Experiência Profissional** | Experiência total de ~3 anos (incluindo estágios/jovem aprendiz). | Embora a vaga seja “Júnior”, a falta de experiência específica em engenharia de IA pode ser um ponto fraco. |\n\n---\n\n## 3️⃣ PONTOS DE ATENÇÃO  \n\n| Aspecto | Observação | Implicação |\n|---------|------------|------------|\n| **Progressão de Cargo** | Evoluiu de **Jovem Aprendiz → Auxiliar Administrativo → Analista de Infraestrutura → Analista de Dados Pleno** em menos de 3 anos. | Indica rápida aprendizagem e adaptabilidade; porém, a mudança de áreas (admin → infraestrutura → analytics) pode sugerir falta de foco em IA. |\n| **Frequência de Trocas** | Mudança de empresa a cada 1‑2 anos (CASSI → GlobalWeb). | Pode ser visto como instabilidade ou busca por crescimento. Avaliar motivação. |\n| **Lacunas Temporais** | Nenhuma lacuna significativa; porém, a última experiência (GlobalWeb) inicia em **Mai/2025**, data futura em relação ao momento atual (2025‑agosto). | Possível erro de digitação; se for real, indica que o candidato ainda está no cargo, o que é positivo. Se for erro, levanta dúvidas sobre atenção aos detalhes. |\n| **Projetos Práticos de IA** | Não há menção a projetos de produção de modelos de IA, deployment ou MLOps. | Falta de portfólio que comprove capacidade de “entregar IA em produção”. |\n| **Certificações ou Cursos Avançados** | Cursos concluídos em 2023‑2024 (Power BI Expert, Machine Learning, Data Storytelling). | Atualização constante, mas ainda faltam certificações em nuvem (Azure AI Engineer, AWS Machine Learning). |\n| **Soft Skills** | Voluntariado (distribuição de cestas) e condução de sessões hands‑on indicam boa empatia e capacidade de ensino. | Potencial para atuar como ponte entre times técnicos e de negócio. |\n| **Detalhamento Técnico** | Descrições das atividades são genéricas (“extração e tratamento de dados”, “desenvolvimento de dashboards”). | Falta de métricas de impacto (ex.: % de redução de tempo, volume de dados, número de usuários atendidos). Isso dificulta mensurar a real contribuição. |\n\n---\n\n## 4️⃣ CONCLUSÃO RECRUTAMENTAL  \n\n- **Adequação Geral:** O candidato possui a base acadêmica e a experiência em analytics que se alinham ao perfil de *Data Analyst* e *BI Engineer*. Contudo, a vaga de **Engenheiro de IA Júnior** demanda competências específicas de engenharia de modelos, infraestrutura de nuvem e práticas de MLOps que não são comprovadas no currículo.  \n\n- **Pontos Fortes:**  \n  - Formação em Ciência de Dados & IA.  \n  - Sólido domínio de Python, SQL e Power BI.  \n  - Experiência prática em ETL e automação (Power Apps/Automate).  \n  - Boa comunicação e experiência em treinamento de usuários.  \n\n- **Pontos Fracos / Riscos:**  \n  - Ausência de experiência comprovada com bibliotecas de ML avançadas e frameworks de deep learning.  \n  - Nenhum registro de trabalho com Docker, Kubernetes, CI/CD ou plataformas de nuvem (AWS/Azure).  \n  - Inglês intermediário pode limitar a absorção de material técnico avançado.  \n  - Falta de projetos de implantação de modelos de IA em produção (MLOps).  \n\n- **Recomendação:**  \n  - **Entrevista Técnica Focada:** Avaliar o conhecimento prático de Python (pandas, scikit‑learn) e, se possível, solicitar um pequeno teste de construção de pipeline de ML.  \n  - **Avaliar Interesse em Upskilling:** Verificar se o candidato tem planos de certificação em Azure/AWS e treinamento em Docker/Kubernetes.  \n  - **Considerar para Posição de Analista de Dados com Trajetória para IA:** Caso a empresa deseje desenvolver talento interno, Lucas pode ser inserido em um programa de mentoria em MLOps, mas não deve ser alocado imediatamente em tarefas críticas de produção de IA.  \n\nEm suma, **Lucas Canedo** demonstra potencial e boa base analítica, porém **não atende integralmente aos requisitos críticos de engenharia de IA** exigidos para a vaga. A decisão deve ponderar a necessidade de contratação imediata versus a possibilidade de investimento em desenvolvimento técnico.", "file": "curriculos\\Curriculo_Lucas.pdf"}}, "analysis": {"1": {"id": "a891e051-74b1-46f0-8f5c-67b650f7a6d0", "job_id": "94392c8b-af3e-4454-9bdb-3cd2c7110bd0", "resum_id": "9f436902-8902-4a11-9777-1c2132950957", "name": "Lucas Canedo", "skills": ["Machine Learning", "Databricks", "Python (Data Science)", "SQL", "Power BI (modelagem, DAX, publicação, Power BI Service)", "Power Query & Excel (ETL)", "Power Apps & Power Automate (automação)", "Desenvolvimento de dashboards e data storytelling", "Suporte técnico e treinamento de usuários"], "education": ["Bacharel em Ciência de Dados e Inteligência Artificial – UNIDOMBOSCO (2020 – 2024)", "Ensino Médio – Colégio Adventista Asa Sul (2019)"], "language": [], "score": 6.4}}, "files": {"1": {"file_id": "710576d7-8524-4111-b62c-82db3910db46", "job_id": "94392c8b-af3e-4454-9bdb-3cd2c7110bd0"}}}